src/php/app/Http/Controllers/CartController.php

select * from `toppings`
---
    public function addCartItems(AddRequest $request)
    {
        // セッションからカート情報を取得する
        $cart_id = Session::get('cart');

        $topping_value = $request->input('topping');
        if (is_array($topping_value)) {
            $topping_ids = $topping_value;
        } else {
            $topping_ids = [$topping_value];
        }

        // カートに紐づくCartItemテーブルのコレクションを取得
        $items = CartItem::where('cart_id', $cart_id)
            ->where('item_id', $request->input('id'))
            ->where('size', $request->input('size'))
            ->join('cart_toppings', 'cart_toppings.cart_item_id', '=', 'cart_items.id')
            ->whereIn('cart_toppings.topping_id', $topping_ids)
            ->get();

        $toppings = null; // トッピングがない時にnullのエラーが出てしまうため変数を定義

        // カートの中に同じ商品が存在する場合は数量と金額を追加し、存在しない場合は新しくCartItemテーブルを作成
        if (count($items) > 0) {
            $item = $items->first();